/*******************************************************************************  
* 文件名称：数码管控制实验
* 实验目的：1.掌握数码管驱动电路的设计方法
*           2.掌握数码管显示的基本原理
* 程序说明：J13配置为MM模式时，通过存储器映射方式编程。
* 日期版本：2012-9-4/V1.0a 
*******************************************************************************/

#include "reg52.h"  //定义51单片机特殊功能寄存器
#include "absacc.h"
                       
code unsigned char tab[] = {0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,0x80,0x90};

//主函数
void main(void)
{ 
//	unsigned char i;

	XBYTE[0xC000] = 0xff;
//	XBYTE[0xE000] = tab[1];  //显示数值1
	
    while(1)
	{
		;
    }
}